// 4_2_1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include "classes.h"
#include <iostream>

int main()
{
    CL_8* x;
    string name;
    cin >> name;
    CL_8 cl_8(name);
    x = &cl_8;
    x->CL_8::CL_6::CL_2::CL_1::get_name();
    x->CL_8::CL_6::CL_3::CL_1::get_name();
    x->CL_8::CL_7::CL_4::CL_1::get_name();
    x->CL_8::CL_6::CL_2::get_name();
    x->CL_8::CL_6::CL_3::get_name();
    x->CL_8::CL_7::CL_4::get_name();
    x->CL_8::CL_7::CL_5::get_name();
    x->CL_8::CL_6::get_name();
    x->CL_8::CL_7::get_name();
    x->get_name();
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
